ПроектИБИСИС/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеСвойства</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>Characteristic.ДополнительныеСвойства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПроектИБИСИС/src/InformationRegisters/СвойстваНоменклатуры/СвойстваНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваНоменклатуры</name>
  <resources>
    <name>ЗначениеСвойства</name>
    <type>
      <types>Characteristic.ДополнительныеСвойства</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеСвойства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПроектИБИСИС/src/Catalogs/ХарактеристикиНоменклатуры/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Наименование = "";
	Для Каждого ТекСтр Из Объект.ДополнительныеРеквизиты Цикл
		Наименование = Наименование + ТекСтр.Свойство + ":" + "(" + ТекСтр.Характеристика + ");";
	КонецЦикла;
	ТекущийОбъект.Наименование = Наименование;
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвойстваНоменклатуры.Свойство КАК Свойство,
	|	NULL КАК Характеристика
	|ИЗ
	|	РегистрСведений.СвойстваНоменклатуры КАК СвойстваНоменклатуры
	|ГДЕ
	|	СвойстваНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Владелец);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ДополнительныеРеквизиты.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры
